# PaperPlacement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..PaperPlacement Property
PrintParameters Class See Also
---
The paper placement type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PaperPlacementType PaperPlacement { get; set; }
```

Visual Basic
---
```text
Public Property PaperPlacement As PaperPlacementType
	Get
	Set
```

Visual C++
---
```text
public:
property PaperPlacementType PaperPlacement {
	PaperPlacementType get ();
	void set (PaperPlacementType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the input argument is out of range. |

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace